In [1]:
import pandas as pd

In [2]:
dados = {
    'Idade': [23, 34, 45, 29, 40, 35, 50, 60, 70, 33],
    'Altura': [1.65, 1.70, 1.75, 1.68, 1.72, 1.78, 1.80, 1.85, 1.90, 1.67],
    'Peso': [65, 70, 75, 68, 72, 78, 80, 85, 90, 67]
}
df =pd.DataFrame(dados)
print("Dataframe de exemplo:")
display(df)

Dataframe de exemplo:

   Idade  Altura  Peso
0     23    1.65    65
1     34    1.70    70
2     45    1.75    75
3     29    1.68    68
4     40    1.72    72
5     35    1.78    78
6     50    1.80    80
7     60    1.85    85
8     70    1.90    90
9     33    1.67    67

1. Describe

In [3]:
#Resumo estatístico com describe()
resumo = df.describe()
print("Resumo estatístico com describe():")
display(resumo)

Resumo estatístico com describe():

           Idade     Altura       Peso
count  10.000000  10.000000  10.000000
mean   41.900000   1.750000  75.000000
std    14.563653   0.082057   8.205689
min    23.000000   1.650000  65.000000
25%    33.250000   1.685000  68.500000
50%    37.500000   1.735000  73.500000
75%    48.750000   1.795000  79.500000
max    70.000000   1.900000  90.000000

In [4]:
#É possível usar a notação de ponto e gerar um resumo para uma coluna específica
df.Idade.describe()

count    10.000000
mean     41.900000
std      14.563653
min      23.000000
25%      33.250000
50%      37.500000
75%      48.750000
max      70.000000
Name: Idade, dtype: float64

2. Média (mean())

In [5]:
#Média das colunas
media = df.mean()
print("Média das colunas")
display(media)

Média das colunas

Idade     41.90
Altura     1.75
Peso      75.00
dtype: float64

In [6]:
#Também é ossível usar a notação de ponto
df.Altura.mean()

1.75

3. Mediana (median())

In [7]:
#Mediana da colunas
mediana = df.median()
print("Mediana das colunas")
display(mediana)

Mediana das colunas

Idade     37.500
Altura     1.735
Peso      73.500
dtype: float64

4. Moda (mode())

In [8]:
#Moda das colunas
moda = df.mode()
print("Moda das colunas")
display(moda)

Moda das colunas

   Idade  Altura  Peso
0     23    1.65    65
1     29    1.67    67
2     33    1.68    68
3     34    1.70    70
4     35    1.72    72
5     40    1.75    75
6     45    1.78    78
7     50    1.80    80
8     60    1.85    85
9     70    1.90    90

5. Desvio padrão (std())

In [11]:
#Desvio padrão das colunas
desvio_padrao = df.std()
print("Desvio padrão das colunas:")
display(desvio_padrao)

Desvio padrão das colunas:

Idade     14.563653
Altura     0.082057
Peso       8.205689
dtype: float64

6. Variância (var())

In [12]:
#Variância das colunas
variancia = df.var()
print("Variância das colunas:")
display(variancia)

Variância das colunas:

Idade     212.100000
Altura      0.006733
Peso       67.333333
dtype: float64

7. Soma (sum())

In [13]:
#Soma dos valores das colunas
soma = df.sum()
print("Soma dos valores das colunas:")
display(soma)

Soma dos valores das colunas:

Idade     419.0
Altura     17.5
Peso      750.0
dtype: float64

8. Contagem de valores não nulos (count())

In [14]:
#Contagem de valores não nulos
contagem = df.count()
print("Contagem de valores não nulos:")
display(contagem)

Contagem de valores não nulos:

Idade     10
Altura    10
Peso      10
dtype: int64

9. Mínimo (min()) e máximo (max())

In [15]:
#Valor mínimo das colunas
minimo = df.min()
print("Valor mínimo das colunas")
display(minimo)

#Valor máximo das colunas
maximo = df.max()
print("Valor máximo das colunas:")
display(maximo)

Valor mínimo das colunas

Idade     23.00
Altura     1.65
Peso      65.00
dtype: float64

Valor máximo das colunas:

Idade     70.0
Altura     1.9
Peso      90.0
dtype: float64

10. Correlação (cor())

In [16]:
#Correlação entre as colunas
correlacao = df.corr()
print("Correlação entre as colunas:")
display(correlacao)

Correlação entre as colunas:

           Idade    Altura      Peso
Idade   1.000000  0.946498  0.946498
Altura  0.946498  1.000000  1.000000
Peso    0.946498  1.000000  1.000000

In [17]:
#É possível calcular a correlação de Kendall, Spearman utilizando o parâmetro method. Defaul é 'pearson'
correlacao_kendall = df.corr(method='kendall')
correlacao_kendall

           Idade    Altura      Peso
Idade   1.000000  0.866667  0.866667
Altura  0.866667  1.000000  1.000000
Peso    0.866667  1.000000  1.000000

Mapas em Pandas: função map()

In [18]:
dados2 = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo'],
    'Genero': ['F', 'M', 'M', 'F', 'M'],
    'Idade': [23, 34, 45, 29, 40],
    'Nota': [85, 90, 78, 92, 88]
}
df2 = pd.DataFrame(dados2)
print("Dataframe de exemplo:")
display(df2)

Dataframe de exemplo:

      Nome Genero  Idade  Nota
0      Ana      F     23    85
1    Bruno      M     34    90
2   Carlos      M     45    78
3    Diana      F     29    92
4  Eduardo      M     40    88

Substituindo valores com map()

A função *map()* pode ser usada para substituir valores em uma coluna com base em um dicionário de mapeamento. Por exemplo, vamos substituir os códigos de gênero ('M' e 'F') pela descrição dos gêneros: 'Masculino' e 'Feminino'.

In [20]:
dicionario_generos = {
    'F': 'Feminino',
    'M': 'Masculino'
}
#Aplicando map() para substituir os códigos de gênero
df2['Gênero descritivo'] = df2['Genero'].map(dicionario_generos)
print("Substituição de gêneros com map():")
display(df2)

Substituição de gêneros com map():

      Nome Genero  Idade  Nota Gênero descritivo
0      Ana      F     23    85          Feminino
1    Bruno      M     34    90         Masculino
2   Carlos      M     45    78         Masculino
3    Diana      F     29    92          Feminino
4  Eduardo      M     40    88         Masculino

Aplicando funções com map()

In [21]:
#Função para categorizar notas
def categorizar_nota(nota):
    if nota >= 90:
        return 'Alta'
    elif nota >= 80:
        return 'Media'
    else:
        return 'Baixa'
#Aplicando map() para categorizar as notas no dataframe
df2['Categoria_nota'] = df2['Nota'].map(categorizar_nota)
print("Categorização de notas com map():")
display(df2)

Categorização de notas com map():

      Nome Genero  Idade  Nota Gênero descritivo Categoria_nota
0      Ana      F     23    85          Feminino          Media
1    Bruno      M     34    90         Masculino           Alta
2   Carlos      M     45    78         Masculino          Baixa
3    Diana      F     29    92          Feminino           Alta
4  Eduardo      M     40    88         Masculino          Media

Manipulando valores com funções lambda

In [22]:
#Aplicando uma função lambda para aumentar a idade em 1 ano
df2['Idade_+1'] = df2['Idade'].map(lambda x: x + 1)
print("Idade + 1:")
display(df2)

Idade + 1:

      Nome Genero  Idade  Nota Gênero descritivo Categoria_nota  Idade_+1
0      Ana      F     23    85          Feminino          Media        24
1    Bruno      M     34    90         Masculino           Alta        35
2   Carlos      M     45    78         Masculino          Baixa        46
3    Diana      F     29    92          Feminino           Alta        30
4  Eduardo      M     40    88         Masculino          Media        41

Substituindo valores com métodos aninhados

In [23]:
#Aplicando map() para transformar nomes em maiusculas
df2['Nomes_maiusculos'] = df2['Nome'].map(lambda x: x.upper())
print("Transformação de Nomes para maiúsculas com map():")
display(df2)

Transformação de Nomes para maiúsculas com map():

,Nome,Genero,Idade,Nota,Gênero descritivo,Categoria_nota,Idade_+1,Nomes_maiusculos
0,Ana,F,23,85,Feminino,Media,24,ANA
1,Bruno,M,34,90,Masculino,Alta,35,BRUNO
2,Carlos,M,45,78,Masculino,Baixa,46,CARLOS
3,Diana,F,29,92,Feminino,Alta,30,DIANA
4,Eduardo,M,40,88,Masculino,Media,41,EDUARDO

map() *versus* apply()

map() é mais frequentemente usada para operações em colunas individuais de uma Series, como substituição de valores baseados em um dicionário ou aplicação de uma função simples a cada elemento. Em contraste, apply() é mais versátil e pode ser utilizada tanto em Series quanto em DataFrames, permitindo aplicar uma função ao longo de eixos específicos (linhas ou colunas) de um DataFrame. Enquanto map() é ideal para transformações elementares em colunas únicas, apply() oferece maior flexibilidade para operações mais complexas, incluindo a aplicação de funções que operam em linhas ou colunas inteiras.